[
  {
    "id": 1,
    "name": "Surender Pal Singh",
    "designation": "Chairman",
    "image": "/static/media/lead_01.ad50652906658fb82606.webp",
    "bioLink": "/leadership/surender-pal-singh",
    "slug": "surender-pal-singh",
    "detail": "Surender Pal Singh Saluja is the Chairman, Whole-Time Director and one of the Promoters of Premier Energies. Associated with the company since its incorporation, Premier Energies has achieved many milestones of success under his guidance. He is responsible for providing strategic advice to the Board as well as developing and executing Premier Energies' business strategies. He holds a Bachelor's Degree in Mechanical Engineering Mechanical from Karnatak University. In 2007, he received the National Award for Outstanding Entrepreneurship in Micro and Small Enterprises by the Ministry of Micro, Small and Medium Enterprises, Government of India."
  },
  {
    "id": 2,
    "name": "Chiranjeev Singh",
    "designation": "Managing Director",
    "image": "/static/media/lead_02.2687d23aa35fa3838c23.webp",
    "bioLink": "/leadership/chiranjeev-singh",
    "slug": "chiranjeev-singh",
    "detail": "Chiranjeev Singh Saluja is the Managing Director and one of the Promoters of Premier Energies. He holds a Bachelor's Degree in Engineering from Osmania University and has been with the company since 1997. Responsible for the overall operations of Premier Energies, he plans our short and long-term strategy and leads the way in setting our strategic goals. He was honoured with a professional doctorate in global leadership and management by the European International University in Paris, France. Currently, he is an active member of the Indian Solar Manufacturers Association, All India Solar Industries Association, and the Federation of Indian Chambers of Commerce and Industry."
  },
  {
    "id": 3,
    "name": "Revathi Rohini Buragadda",
    "designation": "Director - Taxation",
    "image": "/static/media/lead_03.d2931f1ada44eadbbca1.webp",
    "bioLink": "/leadership/revathi-rohini-b",
    "slug": "revathi-rohini-b",
    "detail": "Revathi Rohini Buragadda is an Executive Director of Premier Energies. She holds a Bachelor's Degree in Agriculture Sciences from Andhra Pradesh Agricultural University and has been associated with Premier Energies since June 17, 2019. Having previously served as Deputy Commissioner of Commercial Taxes with the State Government of Andhra Pradesh, today she oversees indirect taxation, relations with governmental agencies and insurance for Premier Energies and its subsidiaries."
  },
  {
    "id": 4,
    "name": "SRIDHAR NARAYAN",
    "designation": "",
    "image": "/static/media/lead_04.e0d9966748cc70be87b6.webp",
    "bioLink": "/leadership/sridhar-narayan",
    "slug": "sridhar-narayan",
    "detail": "Sridhar Narayan is a Non-Executive Director of Premier Energies and a nominee of the South Asia Growth Fund II Holdings LLC and South Asia EBT Trust. He has been associated with Premier Energies since September 28, 2021. He holds a Bachelor's Degree in Technology (Mechanical Engineering) from the Institute of Technology, Banaras Hindu University and a Post Graduate Diploma in Management from the Indian Institute of Management, Bangalore. The co-founder and managing partner of GEF Capital Partners and co-head of the South Asia investment practice, he has also served on the board of directors at JRE Asia Capital Advisory Services (India) Private Limited, Renew Power Private Limited and Shakti Pumps (India) Limited."
  },
  {
    "id": 5,
    "name": "ABHISHEK LOONKER",
    "designation": "",
    "image": "/static/media/lead_05.204e4b68c9ac23edbe36.webp",
    "bioLink": "/leadership/abhishek-loonker",
    "slug": "abhishek-loonker",
    "detail": "Abhishek Loonker is a Non-Executive Director of Premier Energies and a nominee of the South Asia Growth Fund II Holdings LLC and South Asia EBT Trust. Currently, he is also the managing director at GEF Capital Partners. He has been with Premier Energies since September 28, 2021. He holds a Bachelor's Degree in Business Administration from the B.K. Majmudar Institute of Business Administration, Gujarat University and a Post Graduate Diploma in Business Management (International Business) from MATS School of Business and IT, where he secured a first rank. He also holds a certificate from Harvard Business School on \"Corporate Restructuring, Mergers and Acquisitions: Creating Value in Turbulent Times\" and is a chartered financial analyst charter holder with the CFA Institute. Abhishek was recognized as one of the '40 under 40' alternative investment professionals in India by the Association of International Wealth Management of India for 2017-2018."
  },
  {
    "id": 6,
    "name": "SUDHIR MOOLA",
    "designation": "Chief Strategy Officer",
    "image": "/static/media/lead_06.7eee2d7ee9856848bb13.webp",
    "bioLink": "/leadership/sudhir-moola",
    "slug": "sudhir-moola",
    "detail": "With an engineering degree from JNTU, Hyderabad; an MS from Colorado University and an MBA from ISB, Sudhir worked with PwC, USA before taking on a directorial mantle at Premier Energies. He heads the EPC business and the construction of our new state-of-the-art manufacturing facility. Sudhir is actively involved in all day-to-day operations of the organization from managing external relations to defining policies, and supervising department heads to working on strategies for growth and business expansion."
  },
  {
    "id": 7,
    "name": "NAND KISHORE KHANDELWAL",
    "designation": "Group Chief Financial Officer",
    "image": "/static/media/lead_07.066b2fba1dd9e69d268c.webp",
    "bioLink": "/leadership/nand-kishore-khandelwal",
    "slug": "nand-kishore-khandelwal",
    "detail": "Nandkishore Khandelwal is the Group Chief Financial Officer of Premier Energies. Associated with the company since September 1, 2023, he is responsible for finance function and strategic planning for Premier Energies. He is an associate member of the Institute of Chartered Accountants of India and was previously associated with Pitti Engineering Limited and Alumeco India Extrusion Limited."
  },
  {
    "id": 8,
    "name": "Adapa Srinivas",
    "designation": "Chief Growth Officer",
    "image": "/static/media/lead_08.d1c4941994b4ed92db23.webp",
    "bioLink": "/leadership/adapa-srinivas",
    "slug": "adapa-srinivas",
    "detail": "Adapa Srinivas is the Chief Growth Officer of Premier Energies and leads the business development, sales and marketing functions of the company. He holds a Bachelor's Degree in Engineering from Nagpur University and a Post Graduate Diploma in Management from Indian Institute of Management Society, Lucknow. He was previously associated with Burger King India Limited and Kellogg India Private Limited."
  },
  {
    "id": 9,
    "name": "CHANDRA MAULI KUMAR",
    "designation": "Senior Vice President",
    "image": "/static/media/lead_09.0cfb2bbd395b67e6ac48.webp",
    "bioLink": "/leadership/chandra-mauli-kumar",
    "slug": "chandra-mauli-kumar",
    "detail": "Chandra Mauli Kumar is the Head - Manufacturing and Technology of Premier Energies' subsidiary, PEPPL. Associated with the company since March 8, 2022, he is responsible for production, engineering, projects, and setting up cell and module lines in Premier Energies and its subsidiaries. He holds a Bachelors' of Science Degree from the University of Bihar and a Master of Science (Electronics) Degree from the University of Delhi. He was previously associated with Indosolar Limited and Tata Power Solar System Limited."
  },
  {
    "id": 10,
    "name": "Ravella Sreenivas Rao",
    "designation": "Vice President - CS",
    "image": "/static/media/lead_10.7eb0656a3a91342cc457.webp",
    "bioLink": "/leadership/ravella-sreenivas-rao",
    "slug": "ravella-sreenivas-rao",
    "detail": "Ravella Sreenivasa Rao is the Vice President - Company Secretary, Legal and Compliance Officer of Premier Energies. With the company since March 24, 2022, he is responsible for secretarial, legal and compliance related functions. He is an associate of the Institute of Company Secretaries of India and an insolvency professional registered with the Insolvency and Bankruptcy Board of India. He was previously associated with Pridhvi Asset Reconstruction and Securitisation Company Limited, Keerthi Industries Limited, Tecumseh Products India Private Limited and SMS Pharmaceuticals Limited."
  },
  {
    "id": 11,
    "name": "Ragunathan Kannan",
    "designation": "Independent Director",
    "image": "/static/media/lead_11.1a01c02f7ac417d99d00.webp",
    "bioLink": "/leadership/ragunathan-kannan",
    "slug": "ragunathan-kannan",
    "detail": "Raghunathan Kannan is an Independent Director of Premier Energies. A fellow of the Institute of Chartered Accountants of India, he has been with Premier Energies since March 12, 2024. He has previously served as a director on the board of Trust AMC Trustee Private Limited."
  },
  {
    "id": 12,
    "name": "Priyanka Gulati",
    "designation": "Independent Director",
    "image": "/static/media/lead_12.fff0af08216e73aa582c.webp",
    "bioLink": "/leadership/priyanka-gulati",
    "slug": "priyanka-gulati",
    "detail": "Priyanka Gulati is an Independent Director of Premier Energies. An associate of the Institute of the Chartered Accountants of India, she has been with Premier Energies since March 12, 2024. She was awarded the Outstanding Woman Entrepreneur of the Year at the third FLO Women Awards of Uttar Pradesh, 2017-2018 by FICCI, and was also awarded at the 2nd edition of the Future Women Leaders' Summit and Awards 2018. She is currently a partner at Grant Thornton Bharat LLP. She is also one of the co-founders of Manthan Management Solutions Private Limited and has served as a manager in Accenture Services Private Limited."
  },
  {
    "id": 13,
    "name": "Jasbir Singh Gujral",
    "designation": "Independent Director",
    "image": "/static/media/lead_13.2a9a8669b41211bff3b3.webp",
    "bioLink": "/leadership/jasbir-singh-gujral",
    "slug": "jasbir-singh-gujral",
    "detail": "Jasbir Singh Gujral is an Independent Director of Premier Energies. Associated with Premier Energies since March 12, 2024, he is a fellow of the Institute of Chartered Accountants of India and the Institute of Internal Auditors Inc., New York. He holds a Bachelor of Commerce (Honours) degree from the University of Delhi. He was previously associated with Triveni Engineering Works Limited and is currently the Managing Director of Syrma SGS Technology Limited."
  },
  {
    "id": 14,
    "name": "Rohan Mehta",
    "designation": "Independent Director",
    "image": "/static/media/lead_14.18a0a7220cef2a033922.webp",
    "bioLink": "/leadership/rohan-mehta",
    "slug": "rohan-mehta",
    "detail": "Rohan Mehta is an Independent Director of Premier Energies. An associate member of the Institute of Chartered Accounts of India, he has been associated with Premier Energies since March 18, 2020. He has been a member of the board of Simplex Consultants and Infra Private Limited and Pakeeza Infrastructure Development Company Private Limited since 2013, and 2015, respectively. He also holds a Certificate of Practice from the Institute of Chartered Accounts of India."
  },
  {
    "id": 15,
    "name": "Uday Pilani Sudhir",
    "designation": "Independent Director",
    "image": "/static/media/lead_15.210b859517f09d488b58.webp",
    "bioLink": "/leadership/uday-pilani-sudhir",
    "slug": "uday-pilani-sudhir",
    "detail": "Uday Sudhir Pilani is an Independent Director of Premier Energies. He holds a Bachelor's Degree in Commerce from Osmania University, Hyderabad and has been with Premier Energies since March 18, 2020. He has previously served as a director on the board of Dipamkara Web Ventures Private Limited."
  }
]
